benchmarks/literature-v1/p21-recovery/manifest.snapshot.yaml
schema_version: 1
benchmark_id: literature-v1

sentinel_case_ids: []

budget:
  sessions: 1
  max_attempts: 2
  max_budget_usd_per_attempt: 10.0
  max_api_equivalent_usd: 20.0

execution:
  auth: subscription
  model: claude-sonnet-4-6
  concurrency: 1
  max_turns: null
  max_budget_usd: 10.0
  per_program_timeout_seconds: 3600
  max_attempts: 2
  cost_basis: api-equivalent

cases:
  - case_id: liver-p21
    experiment: hepatocyte
    program_id: P21
    profile_path: profiles/liver.yaml
    inputs:
      gene_loading: inputs/liver/gene_loading_K50_0_5_top300.csv
      regulators_by_condition:
        young: inputs/liver/50_CRT_log_nCount_RNA_log_nFeature_RNA_log_nFeature_CRISPR_thre5_log_nCount_CRISPR_thre5_young_F.txt
        aged: inputs/liver/50_CRT_log_nCount_RNA_log_nFeature_RNA_log_nFeature_CRISPR_thre5_log_nCount_CRISPR_thre5_aged_F.txt
      ncbi_context: inputs/liver/ncbi_context.json
    expected:
      program_genes:
        - Cyp51
        - Hmgcs1
        - Fdps
        - Msmo1
        - Nsdhl
        - Idi1
        - Acss2
        - Fdft1
        - Tm7sf2
        - Tas2r138
        - Sc5d
        - Hsd17b7
        - Dhcr7
        - Lss
        - Erg28
      distinctive_genes:
        - Mvk
        - Rdh11
        - Ddr2
        - Pmvk
        - Cetn2
        - Zfp839
        - Mvd
        - Acat2
    repeat_count: 1
    hashes:
      profiles/liver.yaml: a3a90411b660576e9c102f6c827fc266eb85d23d25739e23930216caef36dbb7
      inputs/liver/gene_loading_K50_0_5_top300.csv: 1301ba79edccfc5deba0537e254ac3a2ed7a251851f066dd1e232528b7c01250
      inputs/liver/50_CRT_log_nCount_RNA_log_nFeature_RNA_log_nFeature_CRISPR_thre5_log_nCount_CRISPR_thre5_young_F.txt: 909805bb43d8086485eff6c2e7db415bcefe61484a7e68b574c45bc9ca37ba1d
      inputs/liver/50_CRT_log_nCount_RNA_log_nFeature_RNA_log_nFeature_CRISPR_thre5_log_nCount_CRISPR_thre5_aged_F.txt: 7000eaf38fe1b091f9c592cf39dd8851a38db0943256bfecbe907dc854a91b9a
      inputs/liver/ncbi_context.json: 921c4193599e20ddbfe6e2de2d1161fd11422b26f581fe58fb79e4a7f1f468bd